app/controllers/front_controller.rb

  def index
    @recent_reviews = Review.recent.limit(3)
    @top_businesses = Business.top_rated.limit(3)
---
SELECT * FROM "reviews" WHERE ("reviews".reviewable_id = 2 AND "reviews".reviewable_type = 'Business')
SELECT * FROM "businesses" ORDER BY avg_rating DESC LIMIT 3