app/controllers/messages_controller.rb

SELECT * FROM "messages" WHERE ("messages"."id" = 2)
---
  def show
    @message = current_user.received_messages.find(params[:id])