app/controllers/pages_controller.rb

SELECT * FROM "pages" WHERE ("pages"."permalink" = 'businessowners') LIMIT 1
---
  def show
    if params[:permalink]
      @page=Page.find_by_permalink(params[:permalink])