app/controllers/search_controller.rb

SELECT * FROM "businesses" WHERE ((name like '%%nail%%') AND ((city like '%%san ramon, ca%%' or state_region like '%%san ramon, ca%%' or zip_code like '%%san ramon, ca%%')))
---
  def index
    #@search_results = Business.located_at("%"+params[:location]+"%").named("%"+params[:search_string]+"%").in_category(params[:category_id])
    @search_results = Business.find(:all, :origin => params[:location], :within => 25)