app/controllers/sent_controller.rb

   def index
    @messages = current_user.sent_messages.paginate :per_page => 10, :page => params[:page], :order => "created_at DESC"
---
SELECT * FROM "messages" WHERE ("messages".author_id = 1) ORDER BY created_at DESC LIMIT 10 OFFSET 0

  def show
    @message = current_user.sent_messages.find(params[:id])
---
SELECT * FROM "messages" WHERE ("messages"."id" = 3 AND ("messages".author_id = 3))

  def create
    @message = current_user.sent_messages.build(params[:message])

    if @message.save
---
INSERT INTO "messages" ("updated_at", "body", "subject", "author_id", "created_at") VALUES('2009-05-01 22:57:17', 'body of test message 1 ', 'test message 1', 1, '2009-05-01 22:57:17')